# Brewfile development essentials

# taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"

tap "sass/sass"

brew "mas"

# Browsers
cask "brave-browser"
cask "firefox"

# Design
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "figma"

# Notes
cask "miro"
cask "notion"

# Development
cask "dash"
cask "insomnia"
cask "kitty"
cask "nova"

# Utils
cask "appcleaner"
cask "imageoptim"
cask "karabiner-elements"

# packages
brew "bat"
brew "exa"
brew "fd"
brew "lf"
brew "neovim", args: ["HEAD"]
brew "node"
brew "ripgrep"
brew "sass/sass/sass"

# App Store
mas "iA Writer ", id: 775737590
