# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

tap "dart-lang/dart"
tap "sass/sass"

brew "mas"

# Browsers
cask "brave-browser"
cask "firefox"

# CLI
cask "flutter"
cask "google-cloud-sdk"

# Design
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "figma"

# Development
cask "android-studio"
cask "dash"
cask "insomnia"
cask "kitty"
cask "nova"

# Entertainment
cask "spotify"

# Notes
cask "miro"
cask "notion"

# Office
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"

# Social
cask "slack"

# Utils
cask "bartender"
cask "hammerspoon"
cask "karabiner-elements"
cask "onedrive"
cask "rocket"

# packages
brew "bat"
brew "cabal-install"
brew "clojure"
brew "clojure-lsp"
brew "clojurescript"
brew "coreutils"
brew "deno"
brew "elixir", args: ["HEAD"]
brew "elm"
brew "emacs"
brew "eslint"
brew "exa"
brew "fd"
brew "fzf"
# brew "gatsby-cli"
brew "gh"
brew "ghc"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go", args: ["HEAD"]
brew "gopls"
brew "haskell-language-server"
brew "haskell-stack"
# brew "htop"
# brew "lazygit"
brew "lf"
# brew "lua"
brew "luajit"
# brew "luarocks"
brew "mongosh"
brew "mosh"
brew "neovim", args: ["HEAD"]
# brew "node"
brew "nvm"
brew "ocaml"
brew "pinentry-mac"
brew "pnpm"
brew "prettier"
brew "purescript"
brew "ripgrep"
brew "rust"
brew "rustup-init"
# brew "samba"
brew "sass/sass/sass"
brew "subversion"
brew "tmux"
# brew "typescript"
# brew "vue-cli"
brew "webp"
brew "wget"
brew "yarn"
brew "zplug"
# brew "zsh"

# App Store
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Affinity Publisher", 881418622
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "iA Writer", id: 775737590
mas "Logic Pro", id: 634148309
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
# mas "OneDrive", id: 823766827
mas "Pocket", id: 568494494
mas "Refined GitHub", id: 1519867270
mas "Save to Raindrop.io", id: 1549370672
mas "Slack for Desktop", id: 803453959
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
