# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "dart-lang/dart"
tap "sass/sass"

brew "mas"

# Browsers
cask "brave-browser"
cask "firefox"

# Design
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "figma"

# Notes
cask "miro"
cask "notion"
cask "raindropio"

# Development
cask "android-studio"
cask "dash"
cask "flutter"
cask "google-cloud-sdk"
cask "insomnia"
cask "kitty"
cask "nova"

# Social
cask "microsoft-teams"
cask "slack"
cask "zoom"

# Utils
cask "appcleaner"
cask "bartender"
cask "hammerspoon"
cask "imageoptim"
cask "karabiner-elements"
cask "rocket"

# Entertainment
cask "anki"
cask "spotify"

# Audio
cask "ableton-live-suite10"
cask "native-access"

# packages
brew "bat"
brew "cabal-install"
brew "clojure"
brew "clojurescript"
brew "coreutils"
brew "deno"
brew "elixir", args: ["HEAD"]
brew "elm"
brew "emacs"
brew "eslint"
brew "exa"
brew "fd"
brew "fzf"
brew "gatsby-cli"
brew "gh"
brew "ghc"
brew "git-delta"
brew "gnupg"
brew "gopls"
brew "lf"
brew "mongosh"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pinentry-mac"
brew "pnpm"
brew "prettier"
brew "purescript"
brew "ripgrep"
brew "rust"
brew "sass/sass/sass"
brew "vue-cli"
brew "webp"
brew "wget"
brew "yarn"
brew "zplug"

# App Store
mas "Apple Configurator 2", id: 1037126344
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "iA Writer ", id: 775737590
mas "Logic Pro", id: 634148309
mas "Motion", id: 434290957
mas "OneDrive", id: 823766827
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835
