# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/core"
tap "homebrew/cask"
# tap "homebrew/cask-versions"
tap "buo/cask-upgrade"
tap "dart-lang/dart"
tap "sass/sass"

# Brews
brew "bat"
brew "coreutils"
brew "dart" # from tap "dart-lang/dart"
brew "deno"
brew "emacs" #, args: ["HEAD"]
brew "eslint"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "ghc"
brew "git" # homebrew version is ahead of Apple
brew "git-delta"
brew "gnupg"
brew "go"
brew "gopls"
brew "haskell-language-server"
brew "haskell-stack" # Monterey not listed
brew "hlint"
brew "htop"
brew "jq"
brew "lazygit"
brew "lf"
brew "lua"
# brew "luajit", args: ["HEAD"] # not listed for Apple Silicon
brew "luarocks"
brew "mas"
brew "mongosh"
brew "mosh"
brew "neovim", args: ["HEAD"]
brew "nvm"
brew "pinentry-mac" # Monterey not listed
brew "pnpm"
brew "prettier"
brew "ripgrep"
brew "rust"
brew "rustup-init"
brew "sass/sass/sass" # from tap "sass/sass"
brew "starship"#, args: ["HEAD"]
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "android-studio"
cask "bartender"
cask "brave-browser"
cask "dash"
cask "figma"
cask "firefox"
# cask "flutter" # does this work on Apple Silicon
# cask "google-cloud-sdk"
cask "hammerspoon"
cask "insomnia"
# cask "karabiner-elements" # can I set up a workflow without this?
cask "kitty"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "miro"
cask "notion"
cask "rocket"
cask "slack"
cask "spotify"

# Mac App Store
mas "Compressor", id: 424390742
mas "Craft - Docs and Notes Editor", id: 1487937127
mas "Final Cut Pro", id: 424389933
mas "iA Writer", id: 775737590
mas "Logic Pro", id: 634148309
mas "Motion", id: 434290957
mas "OneDrive", id: 823766827
mas "Pocket", id: 568494494
mas "Refined GitHub", id: 1519867270
mas "Save to Raindrop.io", id: 1549370672
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
